Repository: openiddict/openiddict-core
Catalog: src/OpenIddict.Abstractions/Resources/xlf/OpenIddictResources.*.xlf
Languages: ar, de, es, fr, gu, hi, tr, zh_hans, zh_hant

# ID3049
source: The client application is not allowed to use the hybrid flow.
es: La aplicación de cliente no esta permitida a utilizar el flujo híbrido.
fr: Cette application cliente n'est pas autorisée à utiliser le flux hybride.
hi: हाइब्रिड प्रवाह का उपयोग करने के लिए क्लाइंट एप्लिकेशन को अनुमति नहीं है.
tr: Bu istemci uygulamasının hibrit akış kullanmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式使用混合流程.

# ID3051
source: This client application is not allowed to use the specified scope.
es: La aplicación de cliente no esta permitida a utilizar el scope provisto.
fr: Cette application cliente n'est pas autorisée à utiliser la portée spécifiée.
hi: इस क्लाइंट एप्लिकेशन को निर्दिष्ट दायरे का उपयोग करने की अनुमति नहीं है.
tr: Bu istemci uygulamasının belirtilen kapsamları kullanmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式使用指定的 Scope.

# ID3052
source: The specified '{0}' is invalid.
es: El '{0}' provisto no es válida.
fr: Le '{0}' spécifié n'est pas valide.
hi: निर्दिष्ट '{0}' अमान्य है.
tr: Belirtilen '{0}' geçersiz.
zh_hant: 指定的 ‘{0}’ 無效.

# ID3053
source: The '{0}' parameter is not valid for this client application.
es: El parámetro '{0}' no es válido para esta aplicación de cliente.
fr: Le paramètre '{0}' n'est pas valide pour cette application cliente.
hi: इस क्लाइंट एप्लिकेशन के लिए '{0}' पैरामीटर मान्य नहीं है.
tr: '{0}' parametresi bu istemci uygulaması ile geçerli değil.
zh_hant: 引數 ‘{0}’ 對此連線應用程式無效.

# ID3054
source: The '{0}' parameter required for this client application is missing.
es: Flata el parámetro obligatorio '{0}' para esta aplicación de cliente.
fr: Le paramètre '{0}' requis pour cette application cliente est manquant.
hi: इस क्लाइंट एप्लिकेशन के लिए आवश्यक '{0}' पैरामीटर गायब है.
tr: Eksik '{0}' parametresi bu istemci uygulaması için zorunludur.
zh_hant: 未提供此連線應用程式必要引數 ‘{0}’.

# ID3055
source: The specified client credentials are invalid.
es: Las credenciales del cliente provista no son válidas.
fr: Les identifiants client spécifiés ne sont pas valides.
hi: निर्दिष्ट क्लाइंट क्रेडेंशियल अमान्य हैं.
tr: İstemci kimlik bilgileri geçersiz.
zh_hant: 指定的連線應用程式機密無效.

# ID3056
source: This client application is not allowed to use the device endpoint.
es: La aplicación de cliente no esta permitida a utilizar el destino de dispositivo.
fr: Cette application cliente n'est pas autorisée à utiliser le point de terminaison d'appareil.
hi: इस क्लाइंट एप्लिकेशन को डिवाइस एंडपॉइंट का उपयोग करने की अनुमति नहीं है.
tr: İstemci uygulamasının cihaz uçbirimini kullanmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式使用裝置端點.

# ID3057
source: The '{0}' and '{1}' parameters are required when using the client credentials grant.
es: Los parámetros '{0}' y '{1}' son obligatorios cuando la concesión de credenciales de cliente es utilizada.
fr: Les paramètres '{0}' et '{1}' sont requis lors que l'accès par identifiants client est utilisé.
hi: क्लाइंट क्रेडेंशियल्स अनुदान का उपयोग करते समय '{0}' और '{1}' मापदंडों की आवश्यकता होती है.
tr: '{0}' ve '{1}' parametreleri istemci kimlik bilgileri hakkı kullanıldığında zorunludur.
zh_hant: 使用連線應用程式機密授權時, 必須提供引數 ‘{0}’ 和 ‘{1}’.

# ID3058
source: The '{0}' parameter is required when using the device code grant.
es: El parámetro '{0}' es obligatorios cuando la concesion de código de dispositivo es utlizada.
fr: Le paramètre '{0}' est requis lorsque l'accès par code d'appareil est utilisé.
hi: डिवाइस कोड अनुदान का उपयोग करते समय '{0}' पैरामीटर की आवश्यकता होती है.
tr: '{0}' parametresi cihaz kodu hakkı kullanıldığında zorunludur.
zh_hant: 使用裝置代碼授權時, 必須提供引數 ‘{0}’.

# ID3059
source: The mandatory '{0}' and/or '{1}' parameters are missing.
es: Faltan los paramétros obligatorios '{0}' y/o '{1}'.
fr: Les paramètres obligatoires '{0}' et/ou '{1}' sont manquants.
hi: अनिवार्य '{0}' और / या '{1}' पैरामीटर गायब हैं.
tr: Zorunlu '{0}' ve/veya '{1}' parametreleri eksik.
zh_hant: 未提供必要引數 ‘{0}’ 和/或 ‘{1}’.

# ID3060
source: A scope with the same name already exists.
es: Un scope con el mismo nombre ya existe.
fr: Une portée avec le même nom existe déjà.
hi: समान नाम वाला स्कोप पहले से मौजूद है.
tr: Aynı isimde bir kapsam bulunmaktadır..
zh_hant: 已存在具有相同名稱的 Scope.

# ID3063
source: This client application is not allowed to use the token endpoint.
es: La aplicación de cliente no esta permitida a utilizar el destino de token.
fr: Cette application cliente n'est pas autorisée à utiliser le point de terminaison d'obtention de jeton.
hi: इस क्लाइंट एप्लिकेशन को टोकन समापन बिंदु का उपयोग करने की अनुमति नहीं है.
tr: İstemci uygulamasının belirteç uçbirimini kullanmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式使用權杖端點.

# ID3064
source: This client application is not allowed to use the specified grant type.
es: La aplicación de cliente no esta permitida a utilizar el tipo de concesion especificada.
fr: Cette application cliente n'est pas autorisée à utiliser le type d'accès spécifié.
hi: इस ग्राहक एप्लिकेशन को निर्दिष्ट अनुदान प्रकार का उपयोग करने की अनुमति नहीं है.
tr: İstemci uygulamasının belirtilen hak tipini kullanmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式使用指定的驗證類型.

# ID3065
source: The client application is not allowed to use the '{0}' scope.
es: La aplicación de cliente no esta permitida a utilizar la concesion '{0}'.
fr: Cette application cliente n'est pas autorisée à utiliser la portée '{0}'.
hi: क्लाइंट एप्लिकेशन को '{0}' स्कोप का उपयोग करने की अनुमति नहीं है.
tr: İstemci uygulamasının '{0}' kapsamını kullanmaya izni bulunmamaktadır..
zh_hant: 不允許此連線應用程式使用 Scope ‘{0}’.

# ID3066
source: The specified authorization code cannot be used without sending a client identifier.
es: El código de autorización provisto no puede ser utilizado sin enviar un identificador de cliente.
fr: Le code d'autorisation spécifié ne peut pas être utilisé sans envoyer d'identifiant client.
hi: क्लाइंट पहचानकर्ता को भेजे बिना निर्दिष्ट प्राधिकरण कोड का उपयोग नहीं किया जा सकता है.
tr: Belirtilen yetkilendirme kodu istemci tanımlayıcı yollanmadan kullanılamaz.
zh_hant: 若不傳送連線應用程式 ID, 則不能使用指定的授權代碼.

# ID3067
source: The specified device code cannot be used without sending a client identifier.
es: El código de dispositivo provisto no puede ser utilizado sin enviar un identificador de cliente.
fr: Le code d'appareil spécifié ne peut pas être utilisé sans envoyer d'identifiant client.
hi: क्लाइंट पहचानकर्ता को भेजे बिना निर्दिष्ट डिवाइस कोड का उपयोग नहीं किया जा सकता है.
tr: Belirtilen cihaz kodu istemci tanımlayıcı yollanmadan kullanılamaz.
zh_hant: 若不傳送連線應用程式 ID, 則不能使用指定的裝置代碼.

# ID3068
source: The specified refresh token cannot be used without sending a client identifier.
es: El token de actualización provisto no puede ser utilizado sin enviar un identificador de cliente.
fr: Le jeton de rafraîchissement spécifié ne peut pas être utilisé sans envoyer d'identifiant client.
hi: निर्दिष्ट ताज़ा टोकन का उपयोग ग्राहक पहचानकर्ता को भेजे बिना नहीं किया जा सकता है.
tr: Belirtilen yenileme belirteci istemci tanımlayıcı yollanmadan kullanılamaz.
zh_hant: 若不傳送連線應用程式 ID, 則不能使用指定的重新整理權杖.

# ID3069
source: The specified authorization code cannot be used by this client application.
es: El código de autorización provisto no puede ser utilizado por ésta aplicación de cliente.
fr: Le code d'autorisation spécifié ne peut pas être utilisé par cette application cliente.
hi: इस क्लाइंट एप्लिकेशन द्वारा निर्दिष्ट प्राधिकरण कोड का उपयोग नहीं किया जा सकता है.
tr: Belirtilen yetkilendirme kodu istemci uygulaması tarafından kullanılamaz.
zh_hant: 此連線應用程式不能使用指定的授權代碼.

# ID3070
source: The specified device code cannot be used by this client application.
es: El código de dispositivo provisto no puede ser utilizado por ésta aplicación de cliente.
fr: Le code d'appareil spécifié ne peut pas être utilisé par cette application cliente.
hi: इस क्लाइंट एप्लिकेशन द्वारा निर्दिष्ट डिवाइस कोड का उपयोग नहीं किया जा सकता है.
tr: Belirtilen cihaz kodu istemci uygulaması tarafından kullanılamaz.
zh_hant: 此連線應用程式不能使用指定的裝置代碼.

# ID3071
source: The specified refresh token cannot be used by this client application.
es: El código de actualización provisto no puede ser utilizado por ésta aplicación de cliente.
fr: Le jeton de rafraîchissement spécifié ne peut pas être utilisé par cette application cliente.
hi: निर्दिष्ट ताज़ा टोकन का उपयोग इस क्लाइंट एप्लिकेशन द्वारा नहीं किया जा सकता है.
tr: Belirtilen yenileme belirteci istemci uygulaması tarafından kullanılamaz.
zh_hant: 此連線應用程式不能使用指定的重新整理權杖.

# ID3072
source: The specified '{0}' parameter doesn't match the client redirection address the authorization code was initially sent to.
es: El parámetro '{0}' no concuerda con la dirección de redireccionamiento de cliente inicialmente provista en el código de autorización.
fr: Le paramètre '{0}' spécifié ne correspond pas à l'adresse de redirection client à laquelle le code d'autorisation a été initialement envoyé.
hi: निर्दिष्ट '{0}' पैरामीटर ग्राहक पुनर्निर्देशन पते से मेल नहीं खाता है जो प्राधिकरण कोड शुरू में भेजा गया था.
tr: '{0}' parametresi yetkilendirme kodunun ilk yollandığı istemci yönlendirme adresi ile eşleşmiyor.
zh_hant: 指定的引數 ‘{0}’ 與最初發送的連線應用程式重新導向位址不匹配.

# ID3073
source: The '{0}' parameter cannot be used when no '{1}' was specified in the authorization request.
es: El parámetro '{0}' no puede ser utilizado cuando '{1}' fue especificado en la petición de autorizacion..
fr: Le paramètre '{0}' ne peut pas être utilisé lorsqu'aucun '{1}' n'a été spécifié dans la demande d'autorisation.
hi: प्राधिकरण अनुरोध में कोई {{1} 'पैरामीटर का उपयोग नहीं किया जा सकता है.
tr: '{0}' parametresi yetkilendirme isteğinde '{1}' tanımlanmadığında kullanılamaz.
zh_hant: 若授權請求中未指定 ‘{1}’, 則不能使用指定的引數 ‘{0}’.

# ID3074
source: The '{0}' parameter is not valid in this context.
es: El parámetro '{0}' no es válido en este contexto.
fr: Le paramètre '{0}' n'est pas valide dans ce contexte.
hi: इस संदर्भ में '{0}' पैरामीटर मान्य नहीं है.
tr: '{0}' parametresi bu bağlamda geçerli değil.
zh_hant: 引數 ‘{0}’ 在此語境中無效.

# ID3075
source: This client application is not allowed to use the introspection endpoint.
es: La aplicación de cliente no esta permitida a utilizar el destino de introspección
fr: Cette application cliente n'est pas autorisée à utiliser le point de terminaison d'introspection.
hi: इस ग्राहक एप्लिकेशन को आत्मनिरीक्षण समापन बिंदु का उपयोग करने की अनुमति नहीं है.
tr: İstemci uygulamasının içgözlem uçbirimini kullanmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式使用自省端點.

# ID3076
source: The specified token cannot be introspected.
es: El token provisto no se puede introspectar.
fr: Le jeton spécifié ne peut pas être introspecté.
hi: निर्दिष्ट टोकन आत्मनिरीक्षण नहीं किया जा सकता है.
tr: Belirteç içgözlenemez.
zh_hant: 指定的權杖不能自省.

# ID3077
source: The client application is not allowed to introspect the specified token.
es: La aplicación de cliente no está permitida a introspectar el token provisto.
fr: L'application cliente n'est pas autorisée à introspecter le jeton spécifié.
hi: क्लाइंट एप्लिकेशन को निर्दिष्ट टोकन का आत्मनिरीक्षण करने की अनुमति नहीं है.
tr: İstemci uygulamasının belirteci içgözlemlemeye izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式自省指定的權杖.

# ID3078
source: This client application is not allowed to use the revocation endpoint.
es: La aplicación de cliente no está permitida a utilizar el destino de revocación.
fr: Cette application cliente n'est pas autorisée à utiliser le point de terminaison de révocation.
hi: इस क्लाइंट एप्लिकेशन को प्रत्यावर्तन समापन बिंदु का उपयोग करने की अनुमति नहीं है.
tr: İstemci uygulamasının yürürlükten kaldırma uçbirimini kullanmaya izni bulunmamaktadır.
zh_hant: 此連線應用程式不允許使用吊銷端點.

# ID3079
source: This token cannot be revoked.
es: Este token no puede ser revocado.
fr: Ce jeton ne peut pas être révoqué.
hi: इस टोकन को निरस्त नहीं किया जा सकता है.
tr: Belirteç yürürlükten kaldırılamaz.
zh_hant: 無法吊銷此權杖.

# ID3080
source: The client application is not allowed to revoke the specified token.
es: La aplicación de cliente no esta permitida a revocar el token provisto.
fr: Cette application cliente n'est pas autorisée à révoquer le jeton spécifié.
hi: क्लाइंट एप्लिकेशन को निर्दिष्ट टोकन को रद्द करने की अनुमति नहीं है.
tr: İstemci uygulamasının belirteci yürürlükten kaldırmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式吊銷指定的權杖.

# ID3081
source: The mandatory '{0}' header is missing.
es: Falta el encabezamiento obligatorio '{0}'.
fr: L'en-tête obligatoire '{0}' est manquant.
hi: अनिवार्य '{0}' शीर्षक गायब है.
tr: Zorunlu '{0}' başlığı eksik.
zh_hant: 缺少必要標頭 ‘{0}’.

# ID3082
source: The specified '{0}' header is invalid.
es: El encabezamiento '{0}' no es válido.
fr: L'en-tête '{0}' spécifié n'est pas valide.
hi: निर्दिष्ट '{0}' शीर्षक अमान्य है.
tr: '{0}' başlığı geçersiz.
zh_hant: 指定的標頭 ’{0}’ 無效.

# ID3083
source: This server only accepts HTTPS requests.
es: Este servidor solo soporta peticiones HTTPS.
fr: Ce serveur n'accepte que des requêtes HTTPS.
hi: यह सर्वर केवल HTTPS अनुरोध स्वीकार करता है.
tr: Bu sunucu sadece HTTPS isteklerini kabul etmektedir.
zh_hant: 此伺服器僅接受 HTTPS 請求.

# ID3084
source: The specified HTTP method is not valid.
es: El método HTTP provisto no es válido.
fr: La méthode HTTP spécifiée n'est pas valide.
hi: निर्दिष्ट HTTP विधि मान्य नहीं है.
tr: Belirtilen HTTP metodu geçersiz.
zh_hant: 指定的 HTTP 方法無效.

# ID3085
source: A token with the same reference identifier already exists.
es: Un token con la misma referencia identificatoria ya existe.
fr: Un jeton avec le même identifiant par référence existe déjà.
hi: समान संदर्भ पहचानकर्ता के साथ एक टोकन पहले से मौजूद है.
tr: Aynı referans tanımlayıcı ile bir belirteç bulunmaktadır.
zh_hant: 已存在具有相同引用 ID 的權杖.

# ID3086
source: The token type cannot be null or empty.
es: El tipo de token no puede ser ni null ni vacío.
fr: Le type de jeton ne peut pas être null ou vide.
hi: टोकन प्रकार शून्य या रिक्त नहीं हो सकता.
tr: Belirteç tipi boş veya tanımsız olamaz.
zh_hant: 權杖型別不能為空.

# ID3087
source: Multiple client credentials cannot be specified.
es: No se pueden especificar multiples credenciales de cliente.
fr: Plusieurs identifiants client ne peuvent pas être spécifiés.
hi: एकाधिक क्लाइंट क्रेडेंशियल निर्दिष्ट नहीं किए जा सकते हैं.
tr: Birden çok istemci kimlik bilgisi belirtilemez.
zh_hant: 無法指定多個連線應用程式機密.

# ID3088
source: The issuer associated to the specified token is not valid.
es: El emisor asociado al token especificado no es válido.
fr: L'émetteur associé au jeton spécifié n'est pas valide.
hi: निर्दिष्ट टोकन से संबंधित जारीकर्ता मान्य नहीं है.
tr: Belirteç ile ilişkilendirilen kuruluş geçerli değil.
zh_hant: 與指定權杖關聯的頒發者無效.

# ID3089
source: The specified token is not of the expected type.
es: El token especificado no es del tipo esperado.
fr: Le jeton spécifié n'est pas du type attendu.
hi: निर्दिष्ट टोकन अपेक्षित प्रकार का नहीं है.
tr: Belirteç beklenen tipte değil.
zh_hant: 指定的權杖不是預期型別.

# ID3090
source: The signing key associated to the specified token was not found.
es: No se encontró la clave de firma asociada al token especificado.
fr: La clé de signature associée au jeton spécifié n'a pas été trouvée.
hi: निर्दिष्ट टोकन से संबंधित हस्ताक्षरित कुंजी नहीं मिली.
tr: Belirteç ile ilişkilendirilen imzalama anahtarı bulunamadı.
zh_hant: 未找到與指定權杖關聯的簽名金鑰.

# ID3091
source: The signature associated to the specified token is not valid.
es: La firma asociada al token especificado no es válida.
fr: La signature associée au jeton spécifiée n'est pas valid.
hi: निर्दिष्ट टोकन से संबंधित हस्ताक्षर मान्य नहीं है.
tr: Belirteç ile ilişkilendirilen imza geçerli değil.
zh_hant: 與指定權杖關聯的簽名無效.

# ID3092
source: This resource server is currently unavailable.
es: Este servidor de recursos no está disponible actualmente.
fr: Ce serveur de ressource est actuellement indisponible.
hi: वर्तमान में यह संसाधन सर्वर अनुपलब्ध है.
tr: Kaynak sunucusu ulaşılabilir değil.
zh_hant: 此資源伺服器當前不可用.

# ID3093
source: The specified token doesn't contain any audience.
es: El token especificado no contiene ninguna audiencia.
fr: Le jeton spécifié ne contient aucune audience.
hi: निर्दिष्ट टोकन में कोई भी श्रोता नहीं है.
tr: Belirteç izleyici içermemektedir.
zh_hant: 指定的權杖不包含任何目標受眾.

# ID3094
source: The specified token cannot be used with this resource server.
es: El token especificado no se puede utilizar con este servidor de recursos.
fr: Le jeton spécifié ne peut pas être utilisé par ce serveur de ressource.
hi: निर्दिष्ट टोकन का उपयोग इस संसाधन सर्वर के साथ नहीं किया जा सकता है.
tr: Belirteç bu kaynak sunucusu ile kullanılamaz.
zh_hant: 指定的權杖不能用於此資源伺服器.

# ID3095
source: The user represented by the token is not allowed to perform the requested action.
es: El usuario representado por el token no puede realizar la acción solicitada.
fr: L'utilisateur représenté par le jeton n'est pas autorisé à exécuter l'action demandée.
hi: टोकन द्वारा प्रस्तुत उपयोगकर्ता को अनुरोधित कार्रवाई करने की अनुमति नहीं है.
tr: Belirteç ile ilişkilendirilen kullanıcının talep edilen işlemi gerçekleştirmeye izni bulunmamaktadır.
zh_hant: 不允許此權杖代表的使用者執行請求的操作.

# ID3096
source: No issuer could be found in the server configuration.
es: No se pudo encontrar ningún emisor en la configuración del servidor.
fr: Aucun émetteur n'a pu être trouvé dans la configuration du serveur.
hi: सर्वर कॉन्फ़िगरेशन में कोई जारीकर्ता नहीं मिला.
tr: Sunucu yapılandırmasında kuruluş bulunamadı.
zh_hant: 在伺服器配置中找不到頒發者.

# ID3097
source: A server configuration containing an invalid issuer was returned.
es: La respuesta de la configuración de servidor contiene un emisor inválido.
fr: Une configuration serveur contenant un émetteur non valide a été retournée.
hi: अमान्य जारीकर्ता वाला सर्वर कॉन्फ़िगरेशन वापस कर दिया गया था.
tr: Geçersiz bir kuruluş içeren sunucu yapılandırması yanıtı döndü.
zh_hant: 返回了包含無效頒發者的伺服器配置.

# ID3098
source: The issuer returned in the server configuration is not valid.
es: El emisor devuelto en la configuración del servidor no es válido.
fr: L'émetteur retourné dans la configuration du serveur n'est pas valide.
hi: सर्वर कॉन्फ़िगरेशन में जारीकर्ता मान्य नहीं है.
tr: Sunucu yapılandırmasında döndürülen kuruluş yanıtı geçerli değil.
zh_hant: 伺服器配置中返回的頒發者無效.

# ID3099
source: No JWKS endpoint could be found in the server configuration.
es: No se pudo encontrar ningún destino JWKS en la configuración del servidor.
fr: Aucun point de terminaison JWKS n'a pu être trouvé dans la configuration du serveur.
hi: सर्वर कॉन्फ़िगरेशन में कोई JWKS समापन बिंदु नहीं मिला.
tr: Sunucu yapılandırmasında JWKS uçbirimi bulunamadı.
zh_hant: 在伺服器配置中找不到 JWKS 端點.

# ID3100
source: A server configuration containing an invalid JWKS endpoint URL was returned.
es: La respuesta de la configuración de servidor contiene una URL de destino JWKS inválida.
fr: Une configuration serveur contenant une URL invalide pour le point de terminaison JWKS a été retournée.
hi: अमान्य JWKS समापन बिंदु URL वाला सर्वर कॉन्फ़िगरेशन लौटाया गया था.
tr: Geçersiz JWKS uçbirimi adresi içeren sunucu yapılandırması yanıtı döndü.
zh_hant: 返回了包含無效 JWKS 端點的伺服器配置.

# ID3101
source: A server configuration containing an invalid introspection endpoint URL was returned.
es: La respuesta de la configuración de servidor contiene una URL de destino de introspección inválida.
fr: Une configuration serveur contenant une URL invalide pour le point de terminaison d'introspection a été retournée.
hi: अमान्य इंट्रॉस्पेशन एंडपॉइंट URL वाले सर्वर कॉन्फ़िगरेशन को लौटा दिया गया था.
tr: Geçersiz içgözlem uçbirimi adresi adresi içeren sunucu yapılandırması yanıtı döndü.
zh_hant: 返回了包含無效自省端點的伺服器配置.

# ID3102
source: The JWKS document didn't contain a valid '{0}' node with at least one key.
es: El documento JWKS no contenía un nodo '{0}' válido con al menos una clave.
fr: Le document JWKS ne contenait pas de nœud '{0}' valide comportant au moins une clé.
hi: JWKS दस्तावेज़ में कम से कम एक कुंजी के साथ एक वैध '{0}' नोड नहीं था.
tr: JWKS dokümanı en az bir anahtarı olan geçerli bir '{0}' ucu içermemektedir.
zh_hant: JWKS 文件中沒有 ‘{0}’ 節點.

# ID3103
source: A JWKS response containing an unsupported key was returned.
es: La clave contenida en la respuesta JWKS no está soportada.
fr: Une réponse JWKS contenant une clé non supportée a été retournée.
hi: एक असमर्थित कुंजी वाली JWKS प्रतिक्रिया लौटा दी गई थी.
tr: Desteklenmeyen bir anahtar içeren bir JWKS yanıtı döndü.
zh_hant: 返回了包含不受支援的金鑰的 JWKS 響應.

# ID3104
source: A JWKS response containing an invalid key was returned.
es: La clave contenida en la respuesta JWKS es inválida.
fr: Une réponse JWKS contenant une clé non valide a été retournée.
hi: अमान्य कुंजी वाली JWKS प्रतिक्रिया लौटा दी गई थी।
tr: Geçersiz anahtar içeren bir JWKS yanıtı döndü.
zh_hant: 返回了包含無效金鑰的 JWKS 響應.

# ID3105
source: The mandatory '{0}' parameter couldn't be found in the introspection response.
es: No se pudo encontrar el parámetro obligatorio '{0}' en la respuesta de introspección.
fr: Le paramètre obligatoire '{0}' n'a pu être trouvé dans la réponse d'introspection.
hi: आत्मनिरीक्षण प्रतिक्रिया में अनिवार्य '{0}' पैरामीटर नहीं मिला.
tr: Zorunlu '{0}' parametresi içgözlem yanıtında bulunamadı.
zh_hant: 自省響應中找不到必要引數 ‘{0}’.

# ID3106
source: The token was rejected by the remote authentication server.
es: El token fue rechazado por el servidor de autenticación remoto.
fr: Le jeton a été rejeté par le serveur d'authentification distant.
hi: रिमोट प्रमाणीकरण सर्वर द्वारा टोकन को अस्वीकार कर दिया गया था.
tr: Belirteç uzak erişim sunucusu tarafından reddedildi.
zh_hant: 權杖被遠端身份驗證伺服器拒絕.

# ID3107
source: The '{0}' claim is malformed or isn't of the expected type.
es: La afirmación "{0}" tiene un formato incorrecto o no es del tipo esperado.
fr: La revendication '{0}' est malformée ou n'est pas du type attendu.
hi: '{0}' दावा विकृत है या अपेक्षित प्रकार का नहीं है.
tr: '{0}' hakkı kusurlu veya beklenen tipte değil.
zh_hant: Claim ‘{0}’ 格式錯誤或不是預期型別.

# ID3108
source: An introspection response containing a malformed issuer was returned.
es: La respuesta de introspección contiene un emisor con un formato incorrecto.
fr: Une réponse d'introspection contenant un émetteur malformé a été retournée.
hi: एक विकृत जारीकर्ता युक्त आत्मनिरीक्षण प्रतिक्रिया लौटा दी गई.
tr: Kusurlu kuruluş içeren bir içgözlem yanıtı döndü.
zh_hant: 返回了包含錯誤格式頒發者的自省響應.

# ID3109
source: The issuer returned in the introspection response is not valid.
es: El emisor devuelto en la respuesta de introspección no es válido.
fr: L'émetteur retourné dans la réponse d'introspection n'est pas valide.
hi: जारीकर्ता आत्मनिरीक्षण प्रतिक्रिया में लौटाया गया मान्य नहीं है.
tr: İçgözlem yanıtında dönen kuruluş geçerli değil.
zh_hant: 自省響應返回的頒發者無效.

# ID3110
source: The type of the introspected token doesn't match the expected type.
es: El tipo de token introspectado no coincide con el tipo esperado.
fr: Le type du jeton introspecté ne correspond pas au type attendu.
hi: अंतर्मुखी टोकन का प्रकार अपेक्षित प्रकार से मेल नहीं खाता है.
tr: İçgözlenen belirteç tipi beklenen tipte değil.
zh_hant: 自省權杖的型別與預期型別不匹配.

# ID3111
source: An application with the same client identifier already exists.
es: Ya existe una aplicación con el mismo identificador de cliente.
fr: Une application avec le même identifiant client existe déjà.
hi: समान क्लाइंट पहचानकर्ता के साथ एक एप्लिकेशन पहले से मौजूद है.
tr: Aynı istemci belirteci ile başka bir uygulama bulunmaktadır.
zh_hant: 已存在具有相同消費者金鑰的應用程式.
