Repository: openiddict/openiddict-core
Catalog: src/OpenIddict.Abstractions/Resources/xlf/OpenIddictResources.*.xlf
Languages: ar, de, es, fr, gu, hi, tr, zh_hans, zh_hant

# ID3112
source: Only confidential, hybrid or public applications are supported by the default application manager.
es: El administrador de aplicaciones predeterminado solo admite aplicaciones confidenciales, híbridas o públicas.
fr: Seules les applications confidentielles, hybrides ou publiques sont supportées par le gestionnaire d'application par défaut.
hi: केवल गोपनीय, हाइब्रिड या सार्वजनिक एप्लिकेशन डिफ़ॉल्ट एप्लिकेशन मैनेजर द्वारा समर्थित हैं.
tr: Varsayılan uygulama yöneticisi tarafından sadece gizli, hibrit ve umumi uygulamalar desteklenmektedir.
zh_hant: 預設應用程式管理器僅支援機密、混合或公共應用程式.

# ID3113
source: The client secret cannot be null or empty for a confidential application.
es: El secreto del cliente no puede ser nulo ni vacío para una aplicación confidencial.
fr: Le secret client ne peut pas être null ou vide pour une application confidentielle.
hi: गोपनीय के लिए क्लाइंट रहस्य शून्य या रिक्त नहीं हो सकता.
tr: Gizli uygulama için istemci gizli anahtarı boş veya tanımsız olamaz.
zh_hant: 對於機密應用程式, 連線應用程式金鑰不能為空.

# ID3114
source: A client secret cannot be associated with a public application.
es: Un secreto de cliente no se puede asociar a una aplicación pública.
fr: Un secret client ne peut pas être associé à une application publique.
hi: एक ग्राहक रहस्य एक सार्वजनिक आवेदन के साथ संबद्ध नहीं किया जा सकता है.
tr: Umumi uygulama gizli anahtar ile ilişkilendirilemez.
zh_hant: 連線應用程式金鑰不能與公共應用程式關聯.

# ID3115
source: Callback URLs cannot contain a fragment.
es: Las URL de retorno no pueden contener un fragmento.
fr: Les URLs de rappel ne peuvent pas contenir de fragment.
hi: कॉलबैक URL में एक टुकड़ा नहीं हो सकता.
tr: Geri çağırma adresi parça içeremez.
zh_hant: 重新導向位址不能包含 fragment.

# ID3116
source: The authorization type cannot be null or empty.
es: El tipo de autorización no puede ser nulo ni vacío.
fr: Le type d'autorisation ne peut pas être null ou vide.
hi: प्राधिकरण प्रकार शून्य या रिक्त नहीं हो सकता.
tr: Yetkilendirme tipi boş veya tanımsız olamaz.
zh_hant: 授權型別不能為空.

# ID3117
source: The specified authorization type is not supported by the default token manager.
es: El tipo de autorización provisto no es compatible con el administrador de tokens predeterminado.
fr: Le type d'autorisation spécifié n'est pas supporté par le gestionnaire de jeton par défaut.
hi: निर्दिष्ट प्राधिकरण प्रकार डिफ़ॉल्ट टोकन प्रबंधक द्वारा समर्थित नहीं है.
tr: Yetkilendirme tipi varsayılan belirteç yöneticisi tarafından desteklenmemektedir.
zh_hant: 預設權杖管理器不支援指定的授權型別.

# ID3118
source: The client type cannot be null or empty.
es: El tipo de cliente no puede ser nulo ni vacío.
fr: Le type de client ne peut pas être null ou vide.
hi: क्लाइंट प्रकार रिक्त या रिक्त नहीं हो सकता.
tr: İstemci tipi boş veya tanımsız olamaz.
zh_hant: 連線應用程式型別不能為空.

# ID3119
source: Callback URLs cannot be null or empty.
es: Las URL de retorno no pueden ser nulas ni vacías.
fr: Les URLs de rappel ne peuvent pas être null ou vides.
hi: कॉलबैक URL शून्य या रिक्त नहीं हो सकते.
tr: Geri çağırma adresi boş veya tanımsız olamaz..
zh_hant: 重新導向位址不能為空.

# ID3120
source: Callback URLs must be valid absolute URLs.
es: Las URL de retorno deben ser URL absolutas válidas.
fr: Les URLs de rappel doit être des URLs valides et absolues.
hi: कॉलबैक URL मान्य निरपेक्ष URL होने चाहिए.
tr: Geri çağırma adresi mutlak ve geçerli bir adres olmalıdır.
zh_hant: 重新導向位址必須是有效的絕對路徑網址.

# ID9000
source: Removes orphaned tokens and authorizations from the database.
es: Elimina tokens y autorizaciones huérfanos de la base de datos.
hi: डेटाबेस से अनाथ टोकन और प्राधिकरणों को निकालता है.
tr: Yetim belirteç ve yetkilendirmeleri veritabanından kaldırır.
zh_hant: 從資料庫中刪除孤立的權杖和授權.

# ID9001
source: Starts the scheduled task at regular intervals.
es: Inicia la tarea programada en intervalos regulares.
hi: नियमित अंतराल पर निर्धारित कार्य शुरू करता है.
tr: Zamanlanmış görevi düzenli aralıklarda başlatır.
zh_hant: 定期啟動計劃的任務.

# ID2098
source: The issuer returned in the server configuration is not valid.
gu: સર્વર ગોઠવણીમાં પાછો આપનાર માન્ય નથી.
zh_hans: 服务器配置中返回的颁发者无效.
