Repository: openiddict/openiddict-core
Catalog: src/OpenIddict.Abstractions/Resources/xlf/OpenIddictResources.*.xlf
Languages: ar, de, es, fr, gu, hi, tr, zh_hans, zh_hant

# ID2000
source: The security token is missing.
ar: رمز الأمان مفقود.
de: Der Security-Token fehlt.
gu: સુરક્ષા ટોકન ખૂટે છે.
zh_hans: 缺少安全令牌.

# ID2001
source: The specified authorization code is invalid.
ar: رمز التفويض المحدد غير صالح.
de: Der angegebene Authorisierungscode ist ungültig.
gu: ઉલ્લેખિત અધિકૃતતા કોડ અમાન્ય છે.
zh_hans: 指定的授权码无效.

# ID2002
source: The specified device code is invalid.
ar: رمز الجهاز المحدد غير صالح.
de: Der angegebene Gerätecode ist ungültig.
gu: ઉલ્લેખિત ઉપકરણ કોડ અમાન્ય છે.
zh_hans: 指定的设备码无效.

# ID2003
source: The specified refresh token is invalid.
ar: رمز التحديث المحدد غير صالح.
de: Der angegebene Refresh-Token ist ungültig.
gu: ઉલ્લેખિત રીફ્રેશ ટોકન અમાન્ય છે.
zh_hans: 指定的刷新令牌无效.

# ID2004
source: The specified token is invalid.
ar: الرمز المحدد غير صالح.
de: Der angegebene Token ist ungültig.
gu: ઉલ્લેખિત ટોકન અમાન્ય છે.
zh_hans: 指定的令牌无效.

# ID2005
source: The specified token is not an authorization code.
ar: الرمز المحدد ليس رمز تفويض.
de: Der angegebene Token ist kein Authorisierungscode.
gu: ઉલ્લેખિત ટોકન એ અધિકૃતતા કોડ નથી.
zh_hans: 指定的令牌不是授权码.

# ID2006
source: The specified token is not an device code.
ar: الرمز المحدد ليس رمز جهاز.
de: Der angegebene Token ist kein Gerätecode.
gu: ઉલ્લેખિત ટોકન એ કોઈ ડિવાઇસ કોડ નથી.
zh_hans: 指定的令牌不是设备码.

# ID2007
source: The specified token is not a refresh token.
ar: الرمز المحدد ليس رمز تحديث.
de: Der angegebene Token ist kein Refresh-Token.
gu: ઉલ્લેખિત ટોકન રીફ્રેશ ટોકન નથી.
zh_hans: 指定的令牌不是刷新令牌.

# ID2008
source: The specified token is not an access token.
ar: الرمز المحدد ليس رمز وصول.
de: Der angegebene Token ist kein Authorisierungscode.
gu: ઉલ્લેખિત ટોકન એ પ્રવેશ ટોકન નથી.
zh_hans: 指定的令牌不是访问令牌.

# ID2009
source: The specified identity token is invalid.
ar: رمز الهوية المحدد غير صالح.
de: Der angegebene Token ist kein Identity Token.
gu: ઉલ્લેખિત ઓળખ ટોકન અમાન્ય છે.
zh_hans: 指定的身份令牌无效.

# ID2010
source: The specified authorization code has already been redeemed.
ar: تم بالفعل استرداد رمز التفويض المحدد.
de: Der angegebene Autorisierungscode wurde bereits eingelöst.
gu: ઉલ્લેખિત અધિકૃતતા કોડ પહેલાથી જ રિડિમ થઈ ગયો છે.
zh_hans: 指定的授权码已兑换.

# ID2011
source: The specified device code has already been redeemed.
ar: تم بالفعل استرداد رمز الجهاز المحدد.
de: Der angegebene Gerätecode wurde bereits eingelöst.
gu: ઉલ્લેખિત ડિવાઇસ કોડ પહેલાથી રિડિમ થઈ ગયો છે.
zh_hans: 指定的设备码已兑换.

# ID2012
source: The specified refresh token has already been redeemed.
ar: تم بالفعل استرداد رمز التحديث المحدد.
de: Der angegebene Refresh-Token wurde bereits eingelöst.
gu: ઉલ્લેખિત રીફ્રેશ ટોકન પહેલાથી જ રિડિમ કરવામાં આવ્યું છે.
zh_hans: 指定的刷新令牌已兑换.

# ID2013
source: The specified token has already been redeemed.
ar: تم بالفعل استرداد الرمز المميز المحدد.
de: Der angegebene Token wurde bereits eingelöst.
gu: ઉલ્લેખિત ટોકન પહેલાથી જ રિડીમ કરવામાં આવ્યું છે.
zh_hans: 指定的令牌已兑换.

# ID2014
source: The authorization has not been granted yet by the end user.
ar: لم يتم منح التفويض بعد من قبل المستخدم النهائي.
de: Die Freigabe wurde vom Endbenutzer noch nicht erteilt.
gu: અંતિમ વપરાશકર્તા દ્વારા હજી સુધી અધિકૃતતા આપવામાં આવી નથી.
zh_hans: 最终用户尚未授权.

# ID2015
source: The authorization was denied by the end user.
ar: تم رفض الإذن من قبل المستخدم.
de: Die Berechtigung wurde vom Endbenutzer verweigert.
gu: અંતિમ વપરાશકર્તા દ્વારા અધિકૃતતા નકારી હતી.
zh_hans: 最终用户拒绝授权.

# ID2016
source: The specified authorization code is no longer valid.
ar: رمز التفويض المحدد لم يعد صالحًا.
de: Der angegebene Autorisierungscode ist nicht mehr gültig.
gu: ઉલ્લેખિત અધિકૃતતા કોડ હવે માન્ય નથી.
zh_hans: 指定的授权码不再有效.

# ID2017
source: The specified device code is no longer valid.
ar: رمز الجهاز المحدد لم يعد صالحًا.
de: Der angegebene Gerätecode ist nicht mehr gültig.
gu: ઉલ્લેખિત ઉપકરણ કોડ હવે માન્ય નથી.
zh_hans: 指定的设备码不再有效.

# ID2018
source: The specified refresh token is no longer valid.
ar: لم يعد رمز التحديث المحدد صالحًا.
de: Der angegebene Refresh-Token ist nicht mehr gültig.
gu: ઉલ્લેખિત રીફ્રેશ ટોકન હવે માન્ય નથી.
zh_hans: 指定的刷新令牌不再有效.

# ID2019
source: The specified token is no longer valid.
ar: لم يعد الرمز المحدد صالحًا.
de: Der angegebene Token ist nicht mehr gültig.
gu: ઉલ્લેખિત ટોકન હવે માન્ય નથી.
zh_hans: 指定的令牌不再有效.

# ID2020
source: The authorization associated with the authorization code is no longer valid.
ar: لم يعد التفويض المرتبط برمز التفويض صالحًا.
de: Die mit dem Autorisierungscode verbundene Autorisierung ist nicht mehr gültig.
gu: અધિકૃતતા કોડ સાથે સંકળાયેલ અધિકૃતતા હવે માન્ય નથી.
zh_hans: 与授权码关联的授权不再有效.

# ID2021
source: The authorization associated with the device code is no longer valid.
ar: لم يعد التفويض المرتبط برمز الجهاز صالحًا.
de: Die mit dem Gerätecode verbundene Autorisierung ist nicht mehr gültig.
gu: ડિવાઇસ કોડ સાથે સંકળાયેલ અધિકૃતતા હવે માન્ય નથી.
zh_hans: 与设备码关联的授权不再有效.

# ID2022
source: The authorization associated with the refresh token is no longer valid.
ar: لم يعد التفويض المرتبط برمز التحديث صالحًا.
de: Die mit dem Refresh-Token verbundene Autorisierung ist nicht mehr gültig.
gu: રીફ્રેશ ટોકન સાથે સંકળાયેલ અધિકૃતતા હવે માન્ય નથી.
zh_hans: 与刷新令牌关联的授权不再有效.

# ID2023
source: The authorization associated with the token is no longer valid.
ar: التفويض المرتبط بالرمز لم يعد صالحًا.
de: Die mit dem Token verbundene Autorisierung ist nicht mehr gültig.
gu: ટોકન સાથે સંકળાયેલ અધિકૃતતા હવે માન્ય નથી.
zh_hans: 与令牌关联的授权不再有效.

# ID2024
source: The token request was rejected by the authentication server.
ar: تم رفض طلب الرمز المميز من قبل خادم المصادقة.
de: TDie Token-Anfrage wurde vom Authentifizierungsserver zurückgewiesen.
gu: પ્રમાણીકરણ સર્વર દ્વારા ટોકન વિનંતીને નકારી કા .ી હતી.
zh_hans: 身份验证服务器拒绝了令牌请求.

# ID2025
source: The user information access demand was rejected by the authentication server.
ar: تم رفض طلب الوصول إلى معلومات المستخدم من قبل خادم المصادقة.
de: Die Anforderung für den Zugriff auf Benutzerinformationen wurde vom Authentifizierungsserver abgelehnt.
gu: વપરાશકર્તા માહિતી પ્રવેશ માંગને પ્રમાણીકરણ સર્વર દ્વારા નકારી હતી.
zh_hans: 身份验证服务器拒绝了用户信息访问请求.

# ID2026
source: The specified user code is no longer valid.
ar: رمز المستخدم المحدد لم يعد صالحًا.
de: Der angegebene Benutzercode ist nicht mehr gültig.
gu: ઉલ્લેખિત વપરાશકર્તા કોડ હવે માન્ય નથી.
zh_hans: 指定的用户码不再有效.

# ID2028
source: The '{0}' parameter is not supported.
ar: المعلمة '{0}' غير مدعومة.
de: Der Parameter '{0}' wird nicht unterstützt.
gu: '{0}' પેરામીટર સપોર્ટેડ નથી.
zh_hans: 不支持参数 ‘{0}’.

# ID2029
source: The mandatory '{0}' parameter is missing.
ar: المعلمة الإلزامية '{0}' مفقودة.
de: Der verpflichtende Parameter '{0}' fehlt.
gu: ફરજિયાત '{0}' પરિમાણ ખૂટે છે.
zh_hans: 缺少必需参数 ‘{0}’.

# ID2030
source: The '{0}' parameter must be a valid absolute URL.
ar: يجب أن تكون المعلمة '{0}' رابط مطلق صالح.
de: Der Parameter '{0}' muss eine gültige, absolute URL sein.
gu: '{0}' પરિમાણ એક માન્ય સંપૂર્ણ URL હોવું આવશ્યક છે.
zh_hans: 参数 ’{0}’ 必须是有效的绝对路径网址.

# ID2031
source: The '{0}' parameter must not include a fragment.
ar: يجب ألا تتضمن المعلمة '{0}' جزءًا.
de: Der Parameter '{0}' darf kein Fragment enthalten.
gu: '{0}' પરિમાણમાં કોઈ ટુકડો શામેલ હોવો જોઈએ નહીં.
zh_hans: 参数 ‘{0}’ 不能包含 fragment.

# ID2032
source: The specified '{0}' is not supported.
ar: '{0}' المحدد غير مدعوم.
de: Der Parameter '{0}' wird nicht unterstützt.
gu: ઉલ્લેખિત '{0}' સપોર્ટેડ નથી.
zh_hans: 不支持指定的 ‘{0}’.

# ID2033
source: The specified '{0}'/'{1}' combination is invalid.
ar: مجموعة '{0}' / "{1}" المحددة غير صالحة.
de: Die angegebene Kombination '{0}'/'{1}' ist ungültig.
gu: ઉલ્લેખિત '{0}' / '{1}' સંયોજન અમાન્ય છે.
zh_hans: 指定的 ‘{0}’ / ‘{1}’ 组合无效.

# ID2034
source: The mandatory '{0}' scope is missing.
ar: النطاق الإلزامي '{0}' مفقود.
de: Der verpflichtende Scope '{0}' fehlt.
gu: ફરજિયાત '{0}' અવકાશ ખૂટે છે.
zh_hans: 缺少必需 Scope ‘{0}’.

# ID2035
source: The '{0}' scope is not allowed.
ar: النطاق '{0}' غير مسموح به.
de: Der Scope '{0}' ist nicht erlaubt.
gu: '{0}' અવકાશની મંજૂરી નથી.
zh_hans: 不允许 Scope ‘{0}’.

# ID2036
source: The client identifier cannot be null or empty.
ar: لا يمكن أن يكون معرف العميل خالياً أو فارغاً.
de: Der Client-Identifier darf nicht null oder leer sein.
gu: ક્લાયંટ ઓળખકર્તા નલ અથવા ખાલી હોઈ શકતા નથી.
zh_hans: 客户端 ID 不能为空.

# ID2037
source: The '{0}' parameter cannot be used without '{1}'.
ar: لا يمكن استخدام المعلمة '{0}' بدون "{1}".
de: Der Parameter '{0}' darf nicht ohne '{1}' benutzt werden.
gu: '{0}' પરિમાણનો ઉપયોગ '{1}' વગર કરી શકાતો નથી.
zh_hans: 参数 ‘{0}’ 要求 ‘{1}’.

# ID2038
source: The status cannot be null or empty.
ar: لا يمكن أن تكون الحالة فارغة أو فارغة.
de: Der Statuscode darf nicht null oder leer sein.
gu: સ્થિતિ નલ અથવા ખાલી હોઈ શકતી નથી.
zh_hans: 状态不能为空.

# ID2039
source: Scopes cannot be null or empty.
ar: لا يمكن أن تكون النطاقات فارغة أو فارغة.
de: Scopes dürfen darf nicht null oder leer sein.
gu: અવકાશ શૂન્ય અથવા ખાલી ન હોઈ શકે.
zh_hans: Scope 不能为空.

# ID2040
source: The '{0}' and '{1}' parameters can only be used with a response type containing '{2}'.
ar: لا يمكن استخدام المعلمات '{0}' و "{1}" إلا مع نوع استجابة يحتوي على "{2}".
de: Die Parameter '{0}' und '{1}' können nur mit einem Response-Typ benutzt werden, der '{2}' enthält.
gu: '{0}' અને '{1}' પરિમાણો ફક્ત '{2}' ધરાવતા પ્રતિભાવ પ્રકાર સાથે જ વાપરી શકાય છે.
zh_hans: 参数 ‘{0}’ 和 ‘{1}’ 只能在响应类型包含 ‘{2}’ 时使用.

# ID2041
source: The specified '{0}' is not allowed when using PKCE.
ar: '{0}' المحدد غير مسموح به عند استخدام PKCE.
de: Der Parameter '{0}' ist bei der Verwendung von PKCE nicht erlaubt.
gu: ઉલ્લેખિત '{0}' ને પીકેસીઇનો ઉપયોગ કરતી વખતે મંજૂરી નથી.
zh_hans: 使用 PKCE 时不允许指定的 ‘{0}’.

# ID2042
source: Scopes cannot contain spaces.
ar: لا يمكن أن تحتوي النطاقات على مسافات.
de: Scopes dürfen keine Leerzeichen enthalten.
gu: અવકાશમાં જગ્યાઓ શામેલ હોઈ શકતી નથી.
zh_hans: Scope 不能包含空格.

# ID2043
source: The specified '{0}' is not valid for this client application.
ar: '{0}' المحدد غير صالح لتطبيق العميل هذا.
de: Der angegebene Parameter '{0}' ist für diese Client-Anwendung nicht gültig.
gu: ઉલ્લેખિત '{0}' આ ક્લાયંટ એપ્લિકેશન માટે માન્ય નથી.
zh_hans: 指定的 ‘{0}’ 对此客户端无效.

# ID2044
source: The scope name cannot be null or empty.
ar: لا يمكن أن يكون اسم النطاق فارغاً.
de: Der Scope-Name darf nicht null oder leer sein.
gu: અવકાશનું નામ નલ અથવા ખાલી હોઈ શકતું નથી.
zh_hans: Scope 不能为空.

# ID2045
source: The scope name cannot contain spaces.
ar: لا يمكن أن يحتوي اسم النطاق على مسافات.
de: Der Scope-Name darf keine Leerzeichen enthalten.
gu: અવકાશ નામમાં જગ્યાઓ શામેલ હોઈ શકતી નથી.
zh_hans: Scope 不能包含空格.

# ID2046
source: This client application is not allowed to use the authorization endpoint.
ar: تطبيق العميل هذا غير مسموح له باستخدام نقطة نهاية التفويض.
de: Die Client-Anwendung darf den Autorisierungsendpunkt nicht verwenden.
gu: આ ક્લાયંટ એપ્લિકેશનને અધિકૃતતા એન્ડપોઇન્ટનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用授权端点.

# ID2047
source: The client application is not allowed to use the authorization code flow.
ar: لا يُسمح لتطبيق العميل باستخدام تدفق رمز التفويض.
de: Die Client-Anwendung darf den Authorization Code Flow nicht verwenden.
gu: ક્લાયંટ એપ્લિકેશનને અધિકૃતતા કોડ ફ્લોનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用授权代码流程.

# ID2048
source: The client application is not allowed to use the implicit flow.
ar: لا يُسمح لتطبيق العميل باستخدام التدفق الضمني.
de: Die Client-Anwendung darf den Implicit Flow nicht verwenden.
gu: ક્લાયંટ એપ્લિકેશનને ગર્ભિત પ્રવાહનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用隐式流程.

# ID2049
source: The client application is not allowed to use the hybrid flow.
ar: لا يُسمح لتطبيق العميل باستخدام التدفق المختلط.
de: Die Client-Anwendung darf den Hybrid Flow nicht verwenden.
gu: ક્લાયંટ એપ્લિકેશનને હાઇબ્રિડ ફ્લોનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用混合流程.

# ID2051
source: This client application is not allowed to use the specified scope.
ar: تطبيق العميل هذا غير مسموح له باستخدام النطاق المحدد.
de: Die Client-Anwendung darf den angegebenen Scope nicht verwenden.
gu: આ ક્લાયંટ એપ્લિકેશનને ઉલ્લેખિત અવકાશનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用指定的 Scope.

# ID2052
source: The specified '{0}' is invalid.
ar: '{0}' المحدد غير صالح.
de: Der angegebene Paramter '{0}' ist ungültig.
gu: ઉલ્લેખિત '{0}' અમાન્ય છે.
zh_hans: 指定的 ‘{0}’ 无效.

# ID2053
source: The '{0}' parameter is not valid for this client application.
ar: المعلمة '{0}' غير صالحة لتطبيق العميل هذا.
de: Der Parameter '{0}' ist für diese Client-Anwendung nicht gültig.
gu: આ ક્લાયંટ એપ્લિકેશન માટે '{0}' પરિમાણ માન્ય નથી.
zh_hans: 参数 ‘{0}’ 对此客户端无效.

# ID2054
source: The '{0}' parameter required for this client application is missing.
ar: المعلمة '{0}' المطلوبة لتطبيق العميل هذا مفقودة.
de: Der für diese Client-Anwendung erforderliche Parameter '{0}' fehlt.
gu: આ ક્લાયંટ એપ્લિકેશન માટે જરૂરી '{0}' પરિમાણ ખૂટે છે.
zh_hans: 未提供此客户端必需参数 ‘{0}’.

# ID2055
source: The specified client credentials are invalid.
ar: بيانات اعتماد العميل المحددة غير صالحة.
de: Die angegebenen Client Credentials sind ungültig.
gu: ઉલ્લેખિત ગ્રાહકના ઓળખપત્રો અમાન્ય છે.
zh_hans: 指定的客户端凭据无效.

# ID2056
source: This client application is not allowed to use the device endpoint.
ar: لا يُسمح لتطبيق العميل هذا باستخدام نقطة نهاية الجهاز.
de: Diese Client-Anwendung darf den Device Endpoint nicht verwenden.
gu: આ ક્લાયંટ એપ્લિકેશનને ડિવાઇસ એન્ડપોઇન્ટનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用设备端点.

# ID2057
source: The '{0}' and '{1}' parameters are required when using the client credentials grant.
ar: معلمات '{0}' و "{1}" مطلوبة عند استخدام منح بيانات اعتماد العميل.
de: Die Parameter '{0}' und '{1}' sind erforderlich, wenn der Client Credentials Grant verwendet wird.
gu: ક્લાયંટ ઓળખાણપત્ર અનુદાનનો ઉપયોગ કરતી વખતે '{0}' અને '{1}' પરિમાણો આવશ્યક છે.
zh_hans: 使用客户端凭据授权时, 必须提供参数 ‘{0}’ 和 ‘{1}’.

# ID2058
source: The '{0}' parameter is required when using the device code grant.
ar: المعلمة '{0}' مطلوبة عند استخدام منحة رمز الجهاز.
de: Der Parameter '{0}' ist erforderlich, wenn der Device Code Grant verwendet wird.
gu: ડિવાઇસ કોડ ગ્રાન્ટનો ઉપયોગ કરતી વખતે '{0}' પેરામીટર આવશ્યક છે.
zh_hans: 使用设备码授权时, 必须提供参数 ‘{0}’.

# ID2059
source: The mandatory '{0}' and/or '{1}' parameters are missing.
ar: معلمات '{0}' و / أو "{1}" الإلزامية مفقودة.
de: Die verpflichtenden Parameter '{0}' und/oder '{1}' fehlen.
gu: ફરજિયાત '{0}' અને/અથવા '{1}' પરિમાણો ખૂટે છે.
zh_hans: 未提供必需参数 ‘{0}’ 和/或 ‘{1}’.

# ID2060
source: A scope with the same name already exists.
ar: يوجد نطاق بنفس الإسم.
de: Ein Scope mit dem gleichen Namen existiert bereits.
gu: સમાન નામનો અવકાશ પહેલેથી અસ્તિત્વમાં છે.
zh_hans: 已存在具有相同名称的 Scope.

# ID2063
source: This client application is not allowed to use the token endpoint.
ar: لا يُسمح لتطبيق العميل هذا باستخدام نقطة نهاية الرمز المميز.
de: Die Client-Anwendung darf den Token-Endpoint nicht verwenden..
gu: આ ક્લાયંટ એપ્લિકેશનને ટોકન એન્ડપોઇન્ટનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用令牌端点.

# ID2064
source: This client application is not allowed to use the specified grant type.
ar: لا يُسمح لتطبيق العميل هذا باستخدام نوع المنحة المحدد.
de: Diese Client-Anwendung darf den angegebenen Grant Type nicht verwenden.
gu: આ ક્લાયંટ એપ્લિકેશનને ઉલ્લેખિત અનુદાન પ્રકારનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用指定的授予类型.

# ID2065
source: The client application is not allowed to use the '{0}' scope.
ar: غير مسموح لتطبيق العميل باستخدام النطاق '{0}'.
de: Diese Client-Anwendung darf den '{0}' Scope nicht verwenden.
gu: ક્લાયંટ એપ્લિકેશનને '{0}' અવકાશનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用 Scope ‘{0}’.

# ID2066
source: The specified authorization code cannot be used without sending a client identifier.
ar: لا يمكن استخدام رمز التفويض المحدد بدون إرسال معرف العميل.
de: Der angegebene Autorisierungscode kann nicht verwendet werden, ohne eine Client-Kennung zu senden.
gu: ઉલ્લેખિત અધિકૃતતા કોડનો ઉપયોગ ક્લાયંટ ઓળખકર્તાને મોકલ્યા વગર કરી શકાતો નથી.
zh_hans: 若不发送客户端 ID, 则不能使用指定的授权码.

# ID2067
source: The specified device code cannot be used without sending a client identifier.
ar: لا يمكن استخدام رمز الجهاز المحدد بدون إرسال معرف العميل.
de: Der angegebene Gerätecode kann nicht verwendet werden, ohne eine Client-Kennung zu senden.
gu: ઉલ્લેખિત ડિવાઇસ કોડનો ઉપયોગ ક્લાયંટ ઓળખકર્તાને મોકલ્યા વગર કરી શકાતો નથી.
zh_hans: 若不发送客户端 ID, 则不能使用指定的设备码.

# ID2068
source: The specified refresh token cannot be used without sending a client identifier.
ar: لا يمكن استخدام رمز التحديث المحدد بدون إرسال معرف العميل.
de: Das angegebene Refresh-Token kann nicht verwendet werden, ohne eine Client-Kennung zu senden.
gu: ઉલ્લેખિત રિફ્રેશ ટોકનનો ઉપયોગ ક્લાયંટ ઓળખકર્તાને મોકલ્યા વગર કરી શકાતો નથી.
zh_hans: 若不发送客户端 ID, 则不能使用指定的刷新令牌.

# ID2069
source: The specified authorization code cannot be used by this client application.
ar: لا يمكن استخدام رمز التفويض المحدد بواسطة تطبيق العميل هذا.
de: Der angegebene Autorisierungscode kann von dieser Client-Anwendung nicht verwendet werden.
gu: ઉલ્લેખિત અધિકૃતતા કોડનો ઉપયોગ આ ક્લાયંટ એપ્લિકેશન દ્વારા કરી શકાતો નથી.
zh_hans: 此客户端不能使用指定的授权码.

# ID2070
source: The specified device code cannot be used by this client application.
ar: لا يمكن استخدام رمز الجهاز المحدد بواسطة تطبيق العميل هذا.
de: Der angegebene Gerätecode kann von dieser Client-Anwendung nicht verwendet werden.
gu: ઉલ્લેખિત ડિવાઇસ કોડનો ઉપયોગ આ ક્લાયંટ એપ્લિકેશન દ્વારા કરી શકાતો નથી.
zh_hans: 此客户端不能使用指定的设备码.

# ID2071
source: The specified refresh token cannot be used by this client application.
ar: لا يمكن استخدام رمز التحديث المحدد بواسطة تطبيق العميل هذا.
de: Der angegebene Refresh-Token kann von dieser Client-Anwendung nicht verwendet werden.
gu: ઉલ્લેખિત રીફ્રેશ ટોકનનો ઉપયોગ આ ક્લાયંટ એપ્લિકેશન દ્વારા કરી શકાતો નથી.
zh_hans: 此客户端不能使用指定的刷新令牌.

# ID2072
source: The specified '{0}' parameter doesn't match the client redirection address the authorization code was initially sent to.
ar: المعلمة '{0}' المحددة لا تطابق عنوان إعادة توجيه العميل الذي تم إرسال رمز التفويض إليه في البداية.
de: Der angegebene '{0}'-Parameter stimmt nicht mit der Redirect-URL des Clients überein, an die der Autorisierungscode ursprünglich gesendet wurde.
gu: ઉલ્લેખિત '{0}' પરિમાણ ક્લાયંટ રીડાયરેક્શન સરનામાં સાથે મેળ ખાતું નથી જે શરૂઆતમાં અધિકૃતિ કોડને મોકલવામાં આવ્યું હતું.
zh_hans: 指定的参数 ‘{0}’ 与最初发送的客户端重定向地址不匹配.

# ID2073
source: The '{0}' parameter cannot be used when no '{1}' was specified in the authorization request.
ar: لا يمكن استخدام المعلمة '{0}' في حالة عدم تحديد "{1}" في طلب التفويض.
de: Der Parameter '{0}' kann nicht verwendet werden, wenn im Authorization Request kein '{1}' angegeben wurde.
gu: જ્યારે '{0}' પરિમાણનો ઉપયોગ સત્તાધિકરણ વિનંતીમાં કોઈ '{1}' ઉલ્લેખિત ન થાય ત્યારે કરી શકાશે નહીં.
zh_hans: 若授权请求中未指定 ‘{1}’, 则不能使用指定的参数 ‘{0}’.

# ID2074
source: The '{0}' parameter is not valid in this context.
ar: المعلمة '{0}' غير صالحة في هذا السياق.
de: Der Parameter '{0}' ist in diesem Kontext ungültig.
gu: '{0}' પરિમાણ આ સંદર્ભમાં માન્ય નથી.
zh_hans: 参数 ‘{0}’ 在此上下文中无效.

# ID2075
source: This client application is not allowed to use the introspection endpoint.
ar: لا يُسمح لتطبيق العميل هذا باستخدام نقطة نهاية الاستبطان.
de: Diese Client-Anwendung darf den Introspection-Endpoint nicht verwenden.
gu: આ ક્લાયંટ એપ્લિકેશનને આત્મનિરીક્ષણ અંતિમ બિંદુનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端使用自省端点.

# ID2076
source: The specified token cannot be introspected.
ar: لا يمكن استبطان الرمز المميز المحدد.
de: Auf dem angegebenen Token kann kann keine Selbstprüfung durchgeführt werden.
gu: ઉલ્લેખિત ટોકન આત્મનિરીક્ષણ કરી શકાતું નથી.
zh_hans: 指定的令牌不能自省.

# ID2077
source: The client application is not allowed to introspect the specified token.
ar: لا يُسمح لتطبيق العميل بفحص الرمز المميز المحدد.
de: Die Client-Anwendung ist nicht zur Selbstprüfung des angegebenen Tokens berechtigt.
gu: ક્લાયંટ એપ્લિકેશનને ઉલ્લેખિત ટોકનને આત્મનિરીક્ષણ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端自省指定的令牌.

# ID2078
source: This client application is not allowed to use the revocation endpoint.
ar: لا يُسمح لتطبيق العميل هذا باستخدام نقطة نهاية الإبطال.
de: Die Client-Anwendung ist zur Benutzung des Revocation-Endpoints nicht berechtigt.
gu: આ ક્લાયંટ એપ્લિકેશનને રિવોલ્યુશન એન્ડપોઇન્ટનો ઉપયોગ કરવાની મંજૂરી નથી.
zh_hans: 此客户端不允许使用吊销端点.

# ID2079
source: This token cannot be revoked.
ar: لا يمكن إبطال هذا الرمز المميز.
de: Dieser Token kann nicht widerrufen werden.
gu: આ ટોકન રદ કરી શકાતું નથી.
zh_hans: 无法吊销此令牌.

# ID2080
source: The client application is not allowed to revoke the specified token.
ar: لا يُسمح لتطبيق العميل بإلغاء الرمز المميز المحدد.
de: Die Client-Anwendung darf den angegebenen Token nicht widerrufen.
gu: ક્લાયંટ એપ્લિકેશનને ઉલ્લેખિત ટોકન રદ કરવાની મંજૂરી નથી.
zh_hans: 不允许此客户端吊销指定的令牌.

# ID2081
source: The mandatory '{0}' header is missing.
ar: header '{0}' الإلزامي مفقود.
gu: ફરજિયાત '{0}' હેડર ખૂટે છે.
zh_hans: 缺少必需标头 ‘{0}’.

# ID2082
source: The specified '{0}' header is invalid.
ar: header '{0}' المحدد غير صالح.
de: Der verpflichtende '{0}'-Header fehlt.
gu: ઉલ્લેખિત '{0}' મથાળું અમાન્ય છે.
zh_hans: 指定的标头 ’{0}’ 无效.

# ID2083
source: This server only accepts HTTPS requests.
ar: لا يقبل هذا الخادم سوى طلبات HTTPS.
de: Der Server akzeptiert nur Anfragen über HTTPS.
gu: આ સર્વર ફક્ત HTTPS વિનંતીઓ સ્વીકારે છે.
zh_hans: 此服务器仅接受 HTTPS 请求.

# ID2084
source: The specified HTTP method is not valid.
ar: طريقة HTTP المحددة غير صالحة.
de: Die angegebene HTTP-Methode ist ungültig.
gu: ઉલ્લેખિત એચટીટીપી પદ્ધતિ માન્ય નથી.
zh_hans: 指定的 HTTP 方法无效.

# ID2085
source: A token with the same reference identifier already exists.
ar: الرمز بنفس مرجع المعرف موجود مسبقاً.
de: Ein Token mit dem gleichen Referenzbezeichner existiert bereits.
gu: સમાન સંદર્ભ ઓળખકર્તા સાથેનું એક ટોકન પહેલાથી અસ્તિત્વમાં છે.
zh_hans: 已存在具有相同引用 ID 的令牌.

# ID2086
source: The token type cannot be null or empty.
ar: لا يمكن أن يكون نوع الرمز المميز خالياً أو فارغاً.
de: Der Tokentyp kann nicht null oder leer sein.
gu: ટોકન પ્રકાર નલ અથવા ખાલી હોઈ શકતો નથી.
zh_hans: 令牌类型不能为空.

# ID2087
source: Multiple client credentials cannot be specified.
ar: لا يمكن تحديد بيانات اعتماد متعددة للعملاء.
de: Mehrere Client Credentials können nicht angegeben werden.
gu: મલ્ટીપલ ક્લાયંટ ઓળખપત્રોનો ઉલ્લેખ કરી શકાતો નથી.
zh_hans: 无法指定多个客户端凭据.

# ID2088
source: The issuer associated to the specified token is not valid.
ar: المُصدر المرتبط بالرمز المحدد غير صالح.
de: Der Issuer, der dem angegebenen Token zugeordnet ist, ist nicht gültig.
gu: ઉલ્લેખિત ટોકન સાથે સંકળાયેલ ઇશ્યુઅર માન્ય નથી.
zh_hans: 与指定令牌关联的颁发者无效.

# ID2089
source: The specified token is not of the expected type.
ar: الرمز المميز المحدد ليس من النوع المتوقع.
de: Der angegebene Token hat nicht den erwarteten Typ.
gu: ઉલ્લેખિત ટોકન અપેક્ષિત પ્રકારનું નથી.
zh_hans: 指定的令牌不是预期类型.

# ID2090
source: The signing key associated to the specified token was not found.
ar: لم يتم العثور على مفتاح التوقيع المرتبط بالرمز المميز المحدد.
de: Der mit dem angegebenen Token verknüpfte Signierschlüssel wurde nicht gefunden.
gu: ઉલ્લેખિત ટોકન સાથે સંકળાયેલ સાઇનિંગ કી મળી ન હતી.
zh_hans: 未找到与指定令牌关联的签名密钥.

# ID2091
source: The signature associated to the specified token is not valid.
ar: التوقيع المرتبط بالرمز المحدد غير صالح.
de: Die mit dem angegebenen Token verbundene Signatur ist nicht gültig.
gu: ઉલ્લેખિત ટોકન સાથે સંકળાયેલ સહી માન્ય નથી.
zh_hans: 与指定令牌关联的签名无效.

# ID2092
source: This resource server is currently unavailable.
ar: خادم الموارد غير متوفر حالياّ.
de: Der Resource Server ist derzeit nicht verfügbar.
gu: આ સંસાધન સર્વર હાલમાં અનુપલબ્ધ છે.
zh_hans: 此资源服务器当前不可用.

# ID2093
source: The specified token doesn't contain any audience.
ar: لا يحتوي الرمز المميز المحدد على أي جمهور.
de: Das angegebene Token enthält keine Audience.
gu: ઉલ્લેખિત ટોકનમાં કોઈ પ્રેક્ષક શામેલ નથી.
zh_hans: 指定的令牌不包含任何目标受众.
