Repository: openiddict/openiddict-core
Catalog: src/OpenIddict.Abstractions/Resources/xlf/OpenIddictResources.*.xlf
Languages: ar, de, es, fr, gu, hi, tr, zh_hans, zh_hant

# ID2094
source: The specified token cannot be used with this resource server.
ar: لا يمكن استخدام الرمز المميز مع خادم المورد هذا.
de: Das angegebene Token kann mit diesem Resource Server nicht verwendet werden.
gu: ઉલ્લેખિત ટોકનનો ઉપયોગ આ સાધન સર્વર સાથે કરી શકાતો નથી.
zh_hans: 指定的令牌不能用于此资源服务器.

# ID2095
source: The user represented by the token is not allowed to perform the requested action.
ar: لا يُسمح للمستخدم الذي يمثله الرمز المميز بتنفيذ الإجراء المطلوب.
de: Der Benutzer, der durch das Token repräsentiert wird, darf die angeforderte Aktion nicht ausführen.
gu: ટોકન દ્વારા રજૂ કરાયેલ વપરાશકર્તાને વિનંતી કરેલી ક્રિયા કરવાની મંજૂરી નથી.
zh_hans: 不允许此令牌代表的用户执行请求的操作.

# ID2096
source: No issuer could be found in the server configuration.
ar: تعذر العثور على أي مُصدر في إعدادات الخادم.
de: In der Serverkonfiguration konnte kein Issuer gefunden werden.
gu: સર્વર ગોઠવણીમાં કોઈ જારી કરનાર મળી શક્યો નથી.
zh_hans: 在服务器配置中找不到颁发者.

# ID2097
source: A server configuration containing an invalid issuer was returned.
ar: تم إرجاع إعدادات خادم يحتوي على مُصدر غير صالح.
de: Es wurde eine Serverkonfiguration mit einem ungültigen Aussteller zurückgegeben.
gu: અમાન્ય અદા કરનારનો સર્વર ગોઠવણી પાછો ફર્યો હતો.
zh_hans: 返回了包含无效颁发者的服务器配置.

# ID2098
source: The issuer returned in the server configuration doesn't match the value set in the validation options.
ar: المُصدر الذي تم إرجاعه في إعدادات الخادم غير صالح.
de: Der in der Serverkonfiguration zurückgegebene Issuer ist nicht gültig.

# ID2099
source: No JWKS endpoint could be found in the server configuration.
ar: تعذر العثور على نقطة نهاية JWKS في إعدادات الخادم.
de: In der Serverkonfiguration konnte kein JWKS-Endpoint gefunden werden.
gu: સર્વર ગોઠવણીમાં કોઈ જેડબ્લ્યુકેએસ સમાપ્ત બિંદુ મળી શક્યું નથી.
zh_hans: 在服务器配置中找不到 JWKS 端点.

# ID2100
source: A server configuration containing an invalid JWKS endpoint URL was returned.
ar: تم إرجاع إعدادات خادم يحتوي على رابط غير صالح لنقطة نهاية JWKS.
de: Es wurde eine Serverkonfiguration mit einer ungültigen JWKS-Endpoint-URL zurückgegeben.
gu: અમાન્ય જેડબ્લ્યુકેએસ અંતિમ બિંદુ URL ધરાવતો સર્વર ગોઠવણી પાછો ફર્યો હતો.
zh_hans: 返回了包含无效 JWKS 端点的服务器配置.

# ID2101
source: A server configuration containing an invalid introspection endpoint URL was returned.
ar: تم إرجاع إعدادات خادم يحتوي على رابط غير صالح لنقطة نهاية الاستبطان.
de: Es wurde eine Serverkonfiguration mit einer ungültigen Introspection-Endpoint-URL zurückgegeben.
gu: અમાન્ય આત્મનિરીક્ષણ અંતિમ બિંદુ URL ધરાવતો સર્વર ગોઠવણી પાછો ફર્યો હતો.
zh_hans: 返回了包含无效自省端点的服务器配置.

# ID2102
source: The JWKS document didn't contain a valid '{0}' node with at least one key.
ar: لا يحتوي مستند JWKS على عقدة '{0}' صالحة بمفتاح واحد على الأقل.
de: Das JWKS-Dokument enthielt keinen gültigen '{0}'-Knoten mit mindestens einem Schlüssel.
gu: જેડબ્લ્યુકેએસ દસ્તાવેજમાં ઓછામાં ઓછી એક કી સાથે માન્ય '{0}' નોડ શામેલ નથી.
zh_hans: JWKS 文档中没有 ‘{0}’ 节点.

# ID2103
source: A JWKS response containing an unsupported key was returned.
ar: تم إرجاع استجابة JWKS تحتوي على مفتاح غير مدعوم.
de: Es wurde eine JWKS-Response mit einem nicht unterstützten Schlüssel zurückgegeben.
gu: અસમર્થિત કી ધરાવતા જેડબ્લ્યુકેએસ નો જવાબ પાછો ફર્યો.
zh_hans: 返回了包含不受支持的密钥的 JWKS 响应.

# ID2104
source: A JWKS response containing an invalid key was returned.
ar: تم إرجاع استجابة JWKS تحتوي على مفتاح غير صالح.
de: Es wurde eine JWKS-Response mit einem ungültigen Schlüssel zurückgegeben.
gu: અમાન્ય કી ધરાવતા જેડબ્લ્યુકેએસ પ્રતિસાદ પાછો ફર્યો.
zh_hans: 返回了包含无效密钥的 JWKS 响应.

# ID2105
source: The mandatory '{0}' parameter couldn't be found in the introspection response.
ar: لا يمكن العثور على المعلمة '{0}' الإلزامية في استجابة التأمل.
de: Der verpflichtende Parameter '{0}' konnte in der Introspektionsantwort nicht gefunden werden.
gu: ફરજિયાત '{0}' પરિમાણ આત્મનિરીક્ષણ પ્રતિસાદમાં શોધી શકાયું નહીં.
zh_hans: 自省响应中找不到必需参数 ‘{0}’.

# ID2106
source: The token was rejected by the remote authentication server.
ar: تم رفض الرمز المميز بواسطة خادم المصادقة عن بُعد.
de: Der Token wurde vom Remote-Authentifizierungsserver zurückgewiesen.
gu: દૂરસ્થ પ્રમાણીકરણ સર્વર દ્વારા ટોકન નામંજૂર કરવામાં આવ્યું હતું.
zh_hans: 令牌被远程身份验证服务器拒绝.

# ID2107
source: The '{0}' claim is malformed or isn't of the expected type.
ar: المطالبة '{0}' مكتوبة بشكل غير صحيح أو أنها ليست من النوع المتوقع.
de: Der '{0}'-Claim ist fehlerhaft oder entspricht nicht dem erwarteten Typ.
gu: '{0}' દાવો દૂષિત છે અથવા અપેક્ષિત પ્રકારનો નથી.
zh_hans: Claim ‘{0}’ 格式错误或不是预期类型.

# ID2108
source: An introspection response containing a malformed issuer was returned.
ar: تم إرجاع استجابة استبطان تحتوي على مُصدر تالف.
de: Eine Introspektionsantwort mit einem fehlerhaften Issuer wurde zurückgeschickt.
gu: દૂષિત અદા કરનારનો આત્મનિરીક્ષણ પ્રતિસાદ પાછો ફર્યો.
zh_hans: 返回了包含错误格式颁发者的自省响应.

# ID2109
source: The issuer returned in the introspection response is not valid.
ar: المُصدر الذي تم إرجاعه في استجابة التأمل غير صالح.
gu: આ રજૂઆત કરનાર આત્મનિરીક્ષણ પ્રતિસાદમાં પરત માન્ય નથી.
zh_hans: 自省响应返回的颁发者无效.

# ID2110
source: The type of the introspected token doesn't match the expected type.
ar: لا يتطابق نوع الرمز المميز الذي تم استبطانه مع النوع المتوقع.
de: Der in der Selbstprüfungsantwort zurückgegebene Issuer ist nicht gültig.
gu: આત્મનિરીક્ષણવાળા ટોકનનો પ્રકાર અપેક્ષિત પ્રકાર સાથે મેળ ખાતો નથી.
zh_hans: 自省令牌的类型与预期类型不匹配.

# ID2111
source: An application with the same client identifier already exists.
ar: التطبيق بنفس معرف العميل موجود مسبقاً.
de: Eine Anwendung mit dem gleichen Client-Identifier existiert bereits.
gu: સમાન ક્લાયંટ ઓળખકર્તા સાથેની એક એપ્લિકેશન પહેલેથી અસ્તિત્વમાં છે.
zh_hans: 已存在具有相同客户端 ID 的应用程序.

# ID2112
source: Only confidential or public applications are supported by the default application manager.
ar: يتم دعم التطبيقات السرية أو الهجينة أو العامة فقط من قبل مدير التطبيق الافتراضي.
de: Nur Confidential, Hybrid oder Public Anwendungen werden vom Standardanwendungsmanager unterstützt.
gu: મૂળભૂત એપ્લિકેશન મેનેજર દ્વારા ફક્ત ગોપનીય, વર્ણસંકર અથવા સાર્વજનિક એપ્લિકેશનોને ટેકો આપવામાં આવે છે.
zh_hans: 默认应用程序管理器仅支持机密、混合或公共应用程序.

# ID2113
source: The client secret cannot be null or empty for a confidential application.
ar: لا يمكن أن يكون سر العميل خالياً أو فارغاً لتطبيق سري.
de: Das Client-Secret darf bei Confidential-Anwendungenkann nicht null oder leer sein.
gu: ગુપ્ત એપ્લિકેશન માટે ક્લાયંટ ક્લાયંટ નલ અથવા ખાલી હોઈ શકતું નથી.
zh_hans: 对于机密应用程序, 客户端密钥不能为空.

# ID2114
source: A client secret cannot be associated with a public application.
ar: لا يمكن ربط سر العميل بتطبيق عام.
de: Ein Client-Secret kann nicht mit einer Public-Anwendung assoziert werden.
gu: ક્લાયંટ સિક્રેટ જાહેર એપ્લિકેશન સાથે સંકળાયેલ હોઈ શકે નહીં.
zh_hans: 客户端密钥不能与公共应用程序关联.

# ID2115
source: Callback URLs cannot contain a fragment.
ar: لا يمكن أن تحتوي روابط معاودة الاتصال على جزء.
de: Callback URLs dürfen kein Fragment enthalten.
gu: કોલબેક URL માં કોઈ ટુકડો હોઈ શકતો નથી.
zh_hans: 回调网址不能包含 fragment.

# ID2116
source: The authorization type cannot be null or empty.
ar: لا يمكن أن يكون نوع التفويض خالياً أو فارغاً.
de: Der Authorization Code kann nicht null oder leer sein.
gu: અધિકૃતતાનો પ્રકાર નલ અથવા ખાલી હોઈ શકતો નથી.
zh_hans: 授权类型不能为空.

# ID2117
source: The specified authorization type is not supported by the default token manager.
ar: نوع التفويض المحدد غير مدعوم من قبل مدير الرمز المميز الافتراضي.
de: Der angegebene Authorization-Type wird vom Standard-Token-Manager nicht unterstützt.
gu: ઉલ્લેખિત અધિકૃતતાનો પ્રકાર મૂળભૂત ટોકન મેનેજર દ્વારા સપોર્ટેડ નથી.
zh_hans: 默认令牌管理器不支持指定的授权类型.

# ID2118
source: The client type cannot be null or empty.
ar: لا يمكن أن يكون نوع العميل خالياً أو فارغاً.
de: Der Client-Type darf nicht null oder leer sein.
gu: ક્લાયંટનો પ્રકાર નલ અથવા ખાલી હોઈ શકતો નથી.
zh_hans: 客户端类型不能为空.

# ID2119
source: Callback URLs cannot be null or empty.
ar: لا يمكن أن تكون روابط معاودة الاتصال خالية أو فارغة.
de: Callback URLs dürfen nicht null oder leer sein.
gu: ક કોલબેક URL ને નલ અથવા ખાલી હોઈ શકતા નથી.
zh_hans: 回调网址不能为空.

# ID2120
source: Callback URLs must be valid absolute URLs.
ar: روابط معاودة الاتصال لابد أن تكون روابط مطلقة صالحة.
de: Callback URLs müssen valide, absolute URLs sein.
gu: ક કોલબેક URL માન્ય પૂર્ણ URL હોવા આવશ્યક છે.
zh_hans: 回调网址必须是有效的绝对路径网址.

# ID8000
source: Removes orphaned tokens and authorizations from the database.
ar: إزالة الرموز المميزة والتراخيص المعزولة من قاعدة البيانات.
de: Entfernt verwaiste Token und Berechtigungen aus der Datenbank.
gu: ડેટાબેઝમાંથી અનાથ ટોકન્સ અને અધિકૃતિઓ દૂર કરે છે.
zh_hans: 从数据库中删除孤立的令牌和授权.

# ID8001
source: Starts the scheduled task at regular intervals.
ar: تبدأ المهمة المجدولة على فترات منتظمة.
de: Startet die geplante Aufgabe in regelmäßigen Abständen.
gu: નિયમિત અંતરાલે સુનિશ્ચિત કાર્ય શરૂ કરે છે.
zh_hans: 定期启动计划的任务.

# ID3000
source: The security token is missing.
es: Falta el token de seguridad.
fr: Le jeton de sécurité est manquant.
hi: सुरक्षा टोकन गायब है.
tr: Güvenlik belirteci eksik.
zh_hant: 缺少安全權杖.

# ID3001
source: The specified authorization code is invalid.
es: El código de autorización provisto no es válido.
fr: Le code d'autorisation spécifié n'est pas valide.
hi: निर्दिष्ट प्राधिकरण कोड अमान्य है.
tr: Belirtilen yetkilendirme kodu geçersiz.
zh_hant: 指定的授權代碼無效.

# ID3002
source: The specified device code is invalid.
es: El código de dispositivo provisto no es válido.
fr: Le code d'appareil spécifié n'est pas valide.
hi: निर्दिष्ट डिवाइस कोड अमान्य है.
tr: Belirtilen cihaz kodu geçersiz.
zh_hant: 指定的裝置代碼無效.

# ID3003
source: The specified refresh token is invalid.
es: El token de actualización provisto no es válido.
fr: Le jeton de rafraîchissement spécifié n'est pas valide.
hi: निर्दिष्ट ताज़ा टोकन अमान्य है.
tr: Belirtilen yenileme belirteci geçersiz.
zh_hant: 指定的重新整理權杖無效.

# ID3004
source: The specified token is invalid.
es: El token provisto no es válido.
fr: Le jeton spécifié n'est pas valide.
hi: निर्दिष्ट टोकन अमान्य है.
tr: Geçersiz belirteç.
zh_hant: 指定的權杖无效.

# ID3005
source: The specified token is not an authorization code.
es: El token provisto no es un código de autorización.
fr: Le jeton spécifié n'est pas un code d'autorisation.
hi: निर्दिष्ट टोकन एक प्राधिकरण कोड नहीं है.
tr: Belirteç Yetkilendirme belirteci değil.
zh_hant: 指定的權杖不是授權代碼.

# ID3006
source: The specified token is not an device code.
es: El token provisto no es un código de dispositivo.
fr: Le jeton spécifié n'est pas un code d'appareil.
hi: निर्दिष्ट टोकन डिवाइस कोड नहीं है.
tr: Belirteç cihaz kodu değil.
zh_hant: 指定的權杖不是裝置代碼.

# ID3007
source: The specified token is not a refresh token.
es: El token provisto no es un token de actualización.
fr: Le jeton spécifié n'est pas un jeton d'actualisation.
hi: निर्दिष्ट टोकन एक ताज़ा टोकन नहीं है.
tr: Belirteç yenileme belirteci değil.
zh_hant: 指定的權杖不是重新整理權杖.

# ID3008
source: The specified token is not an access token.
es: El token provisto no es un token de acceso.
fr: Le jeton spécifié n'est pas un jeton d'accès.
hi: निर्दिष्ट टोकन एक्सेस टोकन नहीं है.
tr: Belirteç erişim belirteci değil.
zh_hant: 指定的權杖不是存取權杖.

# ID3009
source: The specified identity token is invalid.
es: El token provisto de identidad provisto no es válido.
fr: Le jeton d'identité spécifié n'est pas valide.
hi: निर्दिष्ट पहचान टोकन अमान्य है.
tr: Kimlik belirteci geçerli değil.
zh_hant: 指定的識別碼權杖無效.

# ID3010
source: The specified authorization code has already been redeemed.
es: El código de autorización provisto ya ha sido canjeado.
fr: Le jeton d'autorisation spécifié a déjà été échangé.
hi: निर्दिष्ट प्राधिकरण कोड पहले ही भुनाया जा चुका है.
tr: Yetkilendirme belirteci daha önce kullanılmış.
zh_hant: 指定的授權代碼已兌換.

# ID3011
source: The specified device code has already been redeemed.
es: El código de dispositivo provisto ya ha sido canjeado.
fr: Le jeton d'appareil spécifié a déjà été échangé.
hi: निर्दिष्ट डिवाइस कोड पहले ही भुनाया जा चुका है.
tr: Cihaz kodu daha önce kullanılmış.
zh_hant: 指定的设备代碼已兌換.

# ID3012
source: The specified refresh token has already been redeemed.
es: El token de actualización provisto ya ha sido canjeado.
fr: Le jeton de rafraîchissement spécifié a déjà été échangé.
hi: निर्दिष्ट ताज़ा टोकन पहले ही भुनाया जा चुका है.
tr: Yenileme belirteci daha önce kullanılmış.
zh_hant: 指定的重新整理權杖已兌換.

# ID3013
source: The specified token has already been redeemed.
es: El token provisto ya ha sido canjeado.
fr: Le jeton spécifié a déjà été échangé.
hi: निर्दिष्ट टोकन को पहले ही भुनाया जा चुका है.
tr: Belirteç daha önce kullanılmış.
zh_hant: 指定的權杖已兌換.

# ID3014
source: The authorization has not been granted yet by the end user.
es: El usuario final aún no ha concedido la autorización.
fr: L'autorisation n'a pas encore été accordée par l'utilisateur final.
hi: अंतिम उपयोगकर्ता द्वारा प्राधिकरण अभी तक प्रदान नहीं किया गया है.
tr: Yetkilendirme son kullanıcı tarafından henüz verilmedi.
zh_hant: 使用者尚未批准授權.

# ID3015
source: The authorization was denied by the end user.
es: La autorización fue denegada por el usuario final.
fr: L'autorisation a été refusée par l'utilisateur final.
hi: प्राधिकरण को अंतिम उपयोगकर्ता द्वारा अस्वीकार कर दिया गया था.
tr: Yetkilendirme son kullanıcı tarafından reddedildi.
zh_hant: 使用者拒絕授權.

# ID3016
source: The specified authorization code is no longer valid.
es: El codigo de autorización provisto ya no es válido.
fr: Le code d'autorisation spécifié n'est plus valide.
hi: निर्दिष्ट प्राधिकरण कोड अब मान्य नहीं है.
tr: Yetkilendirme kodu artık geçerli değil.
zh_hant: 指定的授權代碼不再有效.

# ID3017
source: The specified device code is no longer valid.
es: El código de dispositivo provisto ya no es válido.
fr: Le code d'appareil spécifié n'est plus valide.
hi: निर्दिष्ट डिवाइस कोड अब मान्य नहीं है.
tr: Cihaz kodu artık geçerli değil.
zh_hant: 指定的裝置代碼不再有效.

# ID3018
source: The specified refresh token is no longer valid.
es: El token de actualización provisto ya no es válido.
fr: Le jeton d'actualisation spécifié n'est plus valide.
hi: निर्दिष्ट ताज़ा टोकन अब मान्य नहीं है.
tr: Yenileme belirteci artık geçerli değil.
zh_hant: 指定的重新整理權杖不再有效.

# ID3019
source: The specified token is no longer valid.
es: El token provisto ya no es válido.
fr: Le jeton spécifié n'est plus valide.
hi: निर्दिष्ट टोकन अब मान्य नहीं है.
tr: Belirteç artık geçerli değil.
zh_hant: 指定的權杖不再有效.

# ID3020
source: The authorization associated with the authorization code is no longer valid.
es: La autorización asociada con el codigo de autorización ya no es válida.
fr: L'autorisation associée au code d'autorisation n'est plus valide.
hi: प्राधिकरण कोड से संबद्ध प्राधिकरण अब मान्य नहीं है.
tr: Yetkilendirme ile ilişkili yetkilendirme kodu artık geçerli değil.
zh_hant: 與授權代碼關聯的授權不再有效.

# ID3021
source: The authorization associated with the device code is no longer valid.
es: La autorización asociada con el código de dispositivo ya no es válida.
fr: L'autorisation associée au code d'appareil n'est plus valide.
hi: डिवाइस कोड से संबद्ध प्राधिकरण अब मान्य नहीं है.
tr: Yetkilendirme ile ilişkili cihaz kodu artık geçerli değil.
zh_hant: 與裝置代碼關聯的授權不再有效.

# ID3022
source: The authorization associated with the refresh token is no longer valid.
es: La autorización asociada con el token de actualización ya no es válida.
fr: L'autorisation associée au jeton d'actualisation n'est plus valide.
hi: ताज़ा टोकन से संबद्ध प्राधिकरण अब मान्य नहीं है.
tr: Yenileme belirteci ile ilişkili cihaz kodu artık geçerli değil.
zh_hant: 與重新整理權杖關聯的授權不再有效.

# ID3023
source: The authorization associated with the token is no longer valid.
es: La autorización asociada con el token ya no es válida.
fr: L'autorisation associée au jeton n'est plus valide.
hi: टोकन से जुड़ा प्राधिकरण अब मान्य नहीं है.
tr: Yetkilendirme ile ilişkili belirteç artık geçerli değil.
zh_hant: 與權杖關聯的授權不再有效.

# ID3024
source: The token request was rejected by the authentication server.
es: La petición del token ha sido rechazada por el servidor de autenticación.
fr: La demande de jeton a été rejetée par le serveur d'authentification.
hi: टोकन अनुरोध प्रमाणीकरण सर्वर द्वारा अस्वीकार कर दिया गया था.
tr: Belirteç isteği erişim sunucusu tarafından reddedildi.
zh_hant: 身份驗證伺服器拒絕了權杖請求.

# ID3025
source: The user information access demand was rejected by the authentication server.
es: La demanda de acceso a la información del usuario ha sido rechazada por el servidor de autenticación.
fr: La demande d'information utilisateur a été rejetée par le serveur d'authentification.
hi: प्रमाणीकरण सर्वर द्वारा उपयोगकर्ता सूचना पहुंच मांग को अस्वीकार कर दिया गया था.
tr: Kullanıcı bilgisi isteği erişim sunucusu tarafından reddedildi.
zh_hant: 身份驗證伺服器拒絕了使用者資訊存取請求.

# ID3026
source: The specified user code is no longer valid.
es: El código de usuario provisto ya no es válido.
fr: Le code utilisateur spécifié n'est plus valide.
hi: निर्दिष्ट उपयोगकर्ता कोड अब मान्य नहीं है.
tr: Kullanıcı kodu artık geçerli değil.
zh_hant: 指定的使用者代碼不再有效.

# ID3028
source: The '{0}' parameter is not supported.
es: El parámetro '{0}' no esta soportado.
fr: Le paramètre '{0}' n'est pas supporté.
hi: '{0}' पैरामीटर समर्थित नहीं है.
tr: '{0}' parametresi desteklenmiyor.
zh_hant: 不支援引數 ‘{0}’.

# ID3029
source: The mandatory '{0}' parameter is missing.
es: Falta el parámetro obligatorio '{0}'.
fr: Le paramètre obligatoire '{0}' est manquant.
hi: अनिवार्य '{0}' पैरामीटर गायब है.
tr: Zorunlu '{0}' parametresi eksik.
zh_hant: 缺少必要引數 ‘{0}’.

# ID3030
source: The '{0}' parameter must be a valid absolute URL.
es: El parámetro '{0}' debe ser una URL absoluta válida.
fr: Le paramètre '{0}' doit être une URL valide et absolue.
hi: '{0}' पैरामीटर एक मान्य पूर्ण URL होना चाहिए.
tr: '{0}' parametresi geçerli bir mutlak link olmalıdır.
zh_hant: 引數 ’{0}’ 必須是有效的絕對路徑網址.

# ID3031
source: The '{0}' parameter must not include a fragment.
es: El parámetro '{0}' no debe incluir un fragmento.
fr: Le paramètre '{0}' ne doit pas comporter de fragment.
hi: '{0}' पैरामीटर में एक टुकड़ा शामिल नहीं होना चाहिए.
tr: '{0}' parametresi parçe içermemelidir.
zh_hant: 引數 ‘{0}’ 不能包含 fragment.

# ID3032
source: The specified '{0}' is not supported.
es: El '{0}' provisto no esta soportado.
fr: Le '{0}' spécifié n'est pas supporté.
hi: निर्दिष्ट '{0}' समर्थित नहीं है.
tr: Belirtilen '{0}' desteklenmemektedir..
zh_hant: 不支援指定的 ‘{0}’.

# ID3033
source: The specified '{0}'/'{1}' combination is invalid.
es: La combinación '{0}'/'{1}' no es válida.
fr: La combinaison '{0}'/'{1}' spécifiée n'est pas valide.
hi: निर्दिष्ट '{0}' / '{1}' संयोजन अमान्य है.
tr: Belirtilen '{0}'/'{1}' kombinasyonu geçersizdir.
zh_hant: 指定的 ‘{0}’ / ‘{1}’ 組合無效.

# ID3034
source: The mandatory '{0}' scope is missing.
es: Falta el scope obligatorio '{0}'.
fr: La portée obligatoire '{0}' est manquante.
hi: अनिवार्य '{0}' स्कोप गायब है.
tr: Zorunlu '{0}' kapsamı eksik.
zh_hant: 缺少必要 Scope ‘{0}’.

# ID3035
source: The '{0}' scope is not allowed.
es: El scope '{0}' no esta permitido.
fr: La portée '{0}' n'est pas autorisée.
hi: '{0}' स्कोप की अनुमति नहीं है.
tr: '{0}' kapsamına izin verilmemektedir.
zh_hant: 不允許 Scope ‘{0}’.

# ID3036
source: The client identifier cannot be null or empty.
es: El identificador de cliente no puede ser nulo ni vacío.
fr: L'identifiant client ne peut pas être null ou vide.
hi: क्लाइंट पहचानकर्ता रिक्त या रिक्त नहीं हो सकता.
tr: İstemci tanımlayıcısı boş veya tanımsız olamaz.
zh_hant: 消費者金鑰不能為空.

# ID3037
source: The '{0}' parameter cannot be used without '{1}'.
es: El parámetro '{0}' debe ser utilizado en conjunto con '{1}'.
fr: Le paramètre '{0}' ne peut pas être utilisé sans '{1}'.
hi: '{0}' पैरामीटर का उपयोग '{1}' के बिना नहीं किया जा सकता है.
tr: '{0}' parametresi '{1}' olmadan kullanılamaz.
zh_hant: 引數 ‘{0}’ 要求 ‘{1}’.

# ID3038
source: The status cannot be null or empty.
es: El estado no puede ser nulo ni vacío.
fr: Le statut ne peut pas être null ou vide.
hi: स्थिति शून्य या रिक्त नहीं हो सकती.
tr: Durum boş veya tanımsız olamaz.
zh_hant: 狀態不能為空.

# ID3039
source: Scopes cannot be null or empty.
es: Los scopes no pueden ser nulos ni vacíos.
fr: Les portées ne peuvent pas être null ou vides.
hi: स्कोप्स शून्य या रिक्त नहीं हो सकते.
tr: Kapsamlar boş veya tanımsız olamaz.
zh_hant: Scope 不能為空.

# ID3040
source: The '{0}' and '{1}' parameters can only be used with a response type containing '{2}'.
es: Los parámetros '{0}' y '{1}' pueden ser usados únicamente con un tipo de respuesta que contenga '{2}'.
fr: Les paramètres '{0}' et '{1}' ne peuvent être utilisés qu'avec un type de réponse contenant '{2}'.
hi: '{0}' और '{1}' मापदंडों का उपयोग केवल '{2}' वाले प्रतिक्रिया प्रकार के साथ किया जा सकता है.
tr: '{0}' ve '{1}' parametreleri ancak '{2}' içeren yanıt tipleri ile kullanılabilir.
zh_hant: 引數 ‘{0}’ 和 ‘{1}’ 只能在響應型別包含 ‘{2}’ 時使用.

# ID3041
source: The specified '{0}' is not allowed when using PKCE.
es: El '{0}' provisto no esta permitido cuando se utiliza PKCE.
fr: Le '{0}' spécifié n'est pas autorisé lorsque PKCE est utilisé.
hi: PKCE का उपयोग करते समय निर्दिष्ट '{0}' की अनुमति नहीं है.
tr: Belirtilen '{0}' PKCE ile birlikte kullanılamaz..
zh_hant: 使用 PKCE 時不允許指定的 ‘{0}’.

# ID3042
source: Scopes cannot contain spaces.
es: Los scopes no pueden tener espacios.
fr: Les portées ne peuvent pas contenir d'espace.
hi: स्कोप में स्थान नहीं हो सकते.
tr: Kapsamlar boşluk içeremez.
zh_hant: Scope 不能包含空格.

# ID3043
source: The specified '{0}' is not valid for this client application.
es: El '{0}' provisto no es válido para esta aplicación de cliente.
fr: Le '{0}' spécifié n'est pas valide pour cette application cliente.
hi: निर्दिष्ट '{0}' इस क्लाइंट एप्लिकेशन के लिए मान्य नहीं है.
tr: Belirtilen '{0}' istemci uygulaması için geçerli değil.
zh_hant: 指定的 ‘{0}’ 對此連線應用程式無效.

# ID3044
source: The scope name cannot be null or empty.
es: El nombre del scope no puede ser nulo ni vacío.
fr: Le nom de la portée ne peut pas être null ou vide.
hi: स्कोप नाम शून्य या रिक्त नहीं हो सकता.
tr: Kapsam ismi boş veya tanımmsız olamaz.
zh_hant: Scope 不能為空.

# ID3045
source: The scope name cannot contain spaces.
es: Le nom de la portée ne peut pas contenir d'espace.
fr: Le nom de la portée ne peut pas contenir d'espace.
hi: स्कोप नाम में रिक्त स्थान नहीं हो सकते.
tr: Kapsam ismi boşluk içeremez.
zh_hant: Scope 不能包含空格.

# ID3046
source: This client application is not allowed to use the authorization endpoint.
es: La aplicación de cliente no esta permitida a utilizar el destino de autorización.
fr: Cette application cliente n'est pas autorisée à utiliser le point de terminaison d'autorisation.
hi: इस क्लाइंट एप्लिकेशन को प्राधिकरण समापन बिंदु का उपयोग करने की अनुमति नहीं है.
tr: Bu istemci uygulamasının yetkilendirme uç birimini kullanmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式使用授權端點.

# ID3047
source: The client application is not allowed to use the authorization code flow.
es: La aplicación de cliente no esta permitida a utilizar el flujo de código de autorización.
fr: Cette application cliente n'est pas autorisée à utiliser le flux d'autorisation par code.
hi: क्लाइंट एप्लिकेशन को प्राधिकरण कोड प्रवाह का उपयोग करने की अनुमति नहीं है.
tr: Bu istemci uygulamasının yetkilendirme kodu akışını kullanmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式使用授權代碼流程.

# ID3048
source: The client application is not allowed to use the implicit flow.
es: La aplicación de cliente no esta permitida a utilizar el flujo implícito.
fr: Cette application cliente n'est pas autorisée à utiliser le flux implicite.
hi: क्लाइंट एप्लिकेशन को निहित प्रवाह का उपयोग करने की अनुमति नहीं है.
tr: Bu istemci uygulamasının implicit akış kullanmaya izni bulunmamaktadır.
zh_hant: 不允許此連線應用程式使用隱式流程.
